Revit 2027 API
BuiltInFailures.RegenFailures.CircularDependencySketchError Property
 There is a circular chain of references among the highlighted elements.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CircularDependencySketchError { get; }
Public Shared ReadOnly Property CircularDependencySketchError As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CircularDependencySketchError {
	FailureDefinitionId^ get ();
}
static member CircularDependencySketchError : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.RegenFailures Class
Autodesk.Revit.DB Namespace